sesion 4 gateway
